[
  [
    {
      "type": "dialogue",
      "text": "“I’m sure I don’t know,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 0,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "said Tom, without showing much interest in the ring.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 0,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“I think,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 1,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I continued,",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 1,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“that this is only one of a number of rings, and that a rope used to run through them the whole length of this channel, so that when a boat wanted to return against the current, the man in the boat could lay hold of the rope and pull himself back.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 1,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“That may be so,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 2,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "said Tom,",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 2,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“but the rope isn’t there now, so it’s of no use to us. You can’t hold on to that ring forever, and if you could we should starve to death, after a while. You’ll have to let go presently, and then down we float again.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 2,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“But, Tom, can’t you see that if people used to go up and down this passage it must lead somewhere, and we are not going to be carried down any dangerous cataract or anything of that sort?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 3,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“I suppose it does lead somewhere; but since we can never get back again, I don’t think it makes much difference whether it leads over a cataract or into some dark hole where we will have to stay and starve. But let her go, Jack. We might as well know what is going to happen, for it is no good stopping here.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 4,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "I did not much like the idea of committing ourselves to the current again. There seemed no help for it, however; so after saying my prayers I let go the ring and the skiff shot away once more.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 5,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "The lantern, which was now lighted, showed us that every few yards there was a ring in the wall, and to one of these rings was hanging a bit of rope. I caught hold of it, but it was very rotten. However, I knew now that I was right about the rings. I felt sure that it was perfectly safe to go down the channel, though I saw that it would be impossible to return.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 6,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "I know very well that a person badly frightened and floating with a strong current in the dark can know but little of the distance over which he passes. But I was quite sure that we were moving fully eight miles an hour, and we were certainly in that curious underground river for at least ten minutes. I also feel safe in saying that we must have gone a good mile when I saw a glimmer of light ahead. Then we came suddenly into another large pool where the water was quiet and which was dimly lighted by an opening in the roof of the cave that seemed fifty feet above us and through which we could catch a glimpse of a little scrap of blue sky.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 7,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "No sooner had we entered this second pool than we were startled by a loud hail. Greatly surprised we peered through the indistinct light and saw dimly the figure of a man. He was standing on a little beach at one side of the pool and was waving his arms at us.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 8,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "We were so glad to see any one in that dismal place that we at once paddled ashore without caring whether the man was a pirate or not, though even if he had been we were well armed and had nothing to fear from one man.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 9,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "When we reached him he fell on his knees and begged us to have pity on a poor wretch and take him away with us. Then he asked who we were; if we belonged to Blackbeard’s crew, and if we were rovers, and a dozen other questions all at once.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 10,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "He was the most ragged man I had ever seen. His clothes were so tattered that he no longer wore them as clothes were worn, but merely twisted them around his body, leaving himself half-naked. His hair and beard were very long and nearly white. His eyes had a strange wild look about them, due no doubt to the long time that he had spent in the dark cave.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 11,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "As soon as he found that we were not dangerous, he begged for rum and tobacco. Finding that we had none, he was very thankful for a piece of boiled ham, which he ate ravenously.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 12,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“How long have you been here?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 13,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I asked, after he had finished the ham.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 13,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“About three or four years,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 14,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he replied.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 14,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“Leastways I think so, but a man can’t keep his reckoning when he’s buried alive. I remember it was the year 1718 that I shipped with Blackbeard, and I was with him two years when he marooned me here.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 14,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Then you’ve only been here about a year; it is 1721 now.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 15,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“One year or four years, what’s the odds when you’re alone and starving underground?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 16,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he answered.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 16,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“Seems to me I’ve been here a hundred years.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 16,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“And there isn’t any way out of the cave except by water?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 17,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I asked.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 17,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Not unless you was a bird or a bat and could fly out of that there scuttle up there. You can see about all there is of the cave. Here I’ve lived and slept and starved and had nothing to do but to walk up and down and catch fish. I’ve had fishin’ enough to last me the rest of my life.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 18,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Haven’t you had anything to eat but fish?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 19,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Not a blessed thing, young master,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 20,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he replied.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 20,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“And raw fish at that.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 20,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“How did you catch them?”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 21,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I asked.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 21,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“I’ll show you,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 22,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he said, getting up and wading into the water till it was up to his waist. He stood perfectly still for a while, looking down into the water, for his eyes were so well used to the dim light that he could see as well as we could in bright daylight. Presently he darted his hands into the water with wonderful swiftness and brought up a good-sized fish which he showed to us and then flung back into the pool.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 22,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“It’s easy enough after you get used to it,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 23,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he said, coming ashore again;",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 23,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“but it was a good while, and I was precious hungry before I thought of it. You see the fish here is naturally blind—for what would be the use of wastin’ eyes on ’em?—and so they can’t see me. But never mind about fish, young master; let’s get out of here and get some decent grub.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 23,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Before we agree to take you with us,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 24,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "said I,",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 24,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“we must know all about you. So go on and tell us who you are and how you came here.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 24,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“I’ll tell you everything, faithful and true, for I know you’re too kind to desert a poor wretch here. I can see it in the handsome faces of the pair of you.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 25,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“I’ve been a pirate, young masters both, for why should I deny it? I’m an Englishman, like you, and I went a privateerin’ when I was a boy. It was just about the same thing as piratin’, but it didn’t pay as well, and wasn’t as pleasant for a lad of spirit; so I deserted at Cape Haytien and j’ined a crew of rovers—that is what you call pirates, you know.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 26,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“I was in the business for several years, and had made a lot of money and lost it mostly, when I had the bad luck to ship with Blackbeard. What did I do it for? Because he was at the very top of the profession then, and any man was proud to belong to his crew. He was the boldest and cruelest man that ever sailed. Even a Spaniard would have been too good to do some of the things he did. Blackbeard would have made his own mother walk the plank as soon as he would a merchant captain. The only thing he was afraid of was ghosts. I remember one night off the north coast of Cuba, it blowing a hurricane at the time, and there was two corposants aloft that scared most of us, but Blackbeard laughed at them, and practiced firing at them with his pistol. But all of a sudden he sung out that he was a dead man, and jumped below. I followed him, for all hands were on the quarter deck, the men being afraid to stay forrard or go below on account of the corposants. Blackbeard had locked himself in his cabin and was callin’ to me to bring him the rum. When I brought it he told me that he had seen the ghost of a woman sittin’ perched on the jaws of the main gaff pointin’ at him with her finger, and that I must tell the mate to bring the schooner up into the wind and shake the ghost off.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 27,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“Of course I didn’t tell the mate, for I didn’t want to have the schooner founder all on account of a ghost that nobody saw except the captain, so I left him in his cabin and went on deck again.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 28,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“Blackbeard didn’t care to be with other pirates, so he hunted over the river that you must have come up, and built the fort at the landin’ place. No one knew about it but him and his crew; he never let a man leave him without swearin’ him on the Bible to keep the secret. We used to careen the schooner at the landin’-place when she needed cleanin’ or calkin’, and this cave was the place where we kept our treasures.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 29,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“I don’t know when Blackbeard had the rings let into the rock and the line run through them so as to haul a boat out of this pool and back to the daylight. It was done afore my time and I remember thinkin’ that the rope was gettin’ pretty rotten and might part some day and leave a lot of us anchored here as I’ve been. It was here that the men used to leave their spare earnin’s, and you’ll find some empty chests yonder that I’ve seen pretty near full of gold and silver. It’s all gone now, for Blackbeard gave the order to take everythin’ aboard the schooner and abandon the cave. He probably suspected that the secret had got out, as it was sure to do some day.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 30,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“The men, as I was sayin’, kept their treasures here, and I’ve seen pretty near the whole ship’s company carousin’ and fightin’ here by the light of battle lanterns. But Blackbeard had a place of his own further down the cave. He had a big iron gate all across the mouth of the channel, and you can see it now if you look across the water. He always used to go to it alone, lockin’ the gate after him, but the last time he went down the channel he never came back.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 31,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Then he must have got out of the cave some other way,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 32,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I exclaimed,",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 32,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“for he is alive yet.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 32,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“I’m sorry to hear that,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 33,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "said the man.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 33,
        "segment_index": 1
      }
    },
    {
      "type": "dialogue",
      "text": "“I’ve been a-hopin’ that he’d been cast away in some place darker than this and had starved worse than I have. That was the only cheerful thought I’ve had here.”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 33,
        "segment_index": 2
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“You must be a pretty bad man to want to have another man suffer,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 34,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "I said.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 34,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "dialogue",
      "text": "“Just so,”",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 35,
        "segment_index": 0
      }
    },
    {
      "type": "narration",
      "text": "he answered, “I have been middlin’ bad, young masters, but you’ll see how different I’ll be when we get away from here. But I’m not gettin’ on with my story.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 35,
        "segment_index": 1
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“I was Blackbeard’s servant the last year I was with him. He’d killed both his last two servants, and I didn’t care much for the place, but it wouldn’t have done to refuse it. Besides, he treated me pretty well, and I had an easy time waitin’ on him, and eatin’ what was left from his table, and it was a sight better than raw fish. However, he banged me over the head considerable and the last time we came up the river I made up my mind to bolt, and take my chances of reachin’ a settlement, for I knew the country hereabouts very well. One day Blackbeard looked into my bunk and saw that I had made a bundle of my clothes, for I meant to bolt at the very first chance. He must have suspected it and that is the reason he left me here.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 36,
        "segment_index": 0
      }
    }
  ],
  [
    {
      "type": "narration",
      "text": "“We had taken everythin’ out of the cave, and expected to sail as soon as the job of cleanin’ the schooner’s bottom was finished. Early one morning, Blackbeard ordered me to bring a lantern and take him into the cave. When we got to this place he ordered me to wait for him while he took the skiff and went to his own private cave. You see he always kept a little skiff, just big enough to hold two, for his own use, and the skiff you come in was the one the men used.",
      "meta": {
        "chapter_index": 1,
        "paragraph_index": 37,
        "segment_index": 0
      }
    }
  ]
]