[
    {
        "entity": "Crimson",
        "lemmatized entity": "crimson",
        "chapter cutoff": 10,
        "description": "In this context, \"crimson\" is used to describe a pervasive, deep red hue that colors the environment, particularly the light from the moon and the appearance of objects. It's not merely a color but also suggests a sense of unease, mystery, and perhaps danger, as it's associated with a bloody handprint and a grotesque wound. The term \"crimson veil\" implies a filtering or obscuring quality to this color, adding to the surreal and disorienting atmosphere. It functions to establish a specific mood and visual theme for the scene, hinting at supernatural or unsettling elements.",
        "term type": "Concept",
        "english target translation": "Crimson"
    },
    {
        "entity": "Lord of the Mysteries",
        "lemmatized entity": "Lord of the Mysteries",
        "chapter cutoff": 10,
        "description": "The \"Lord of the Mysteries\" is a title or designation that the protagonist, Zhou Mingrui (who seems to have transmigrated into the body of Klein Moretti), is associated with or is becoming. The context implies it's a significant, possibly powerful, or even divine entity within the narrative's world. The term carries an air of mystery and perhaps a sense of destiny or a grand, overarching purpose for the protagonist. Its exact nature and implications are not fully revealed in this excerpt, but it clearly marks a pivotal aspect of the protagonist's new identity or future.",
        "term type": "Title",
        "english target translation": "Lord of the Mysteries"
    },
    {
        "entity": "Zhou Mingrui",
        "lemmatized entity": "Zhou Mingrui",
        "chapter cutoff": 10,
        "description": "Zhou Mingrui is the protagonist of the story. Initially, he experiences intense physical pain and confusion, believing he is still dreaming. He discovers himself in an unfamiliar room with strange objects, including a revolver and a notebook with peculiar writing. Through a process of observation and the influx of new memories, he realizes he has transmigrated into a new body and a different world. His background as a reader of web novels allows him to recognize the transmigration trope, and he attempts to remain calm and adapt to his new reality.",
        "term type": "Character Name",
        "english target translation": "Zhou Mingrui"
    },
    {
        "entity": "Klein Moretti",
        "lemmatized entity": "Klein Moretti",
        "chapter cutoff": 10,
        "description": "Klein Moretti is the current identity of the protagonist, Zhou Mingrui, after he transmigrated into a new world. He is a citizen of the Loen Kingdom in the Northern Continent, specifically from Awwa County in the City of Tingen. His family is not wealthy, and they live in a two-bedroom apartment. Klein's mother was a devotee of the Evernight Goddess and passed away the year he was admitted to Khoy University. He has an elder brother and a younger sister. Klein is a history graduate with knowledge of ancient languages like Feysac and Hermes.",
        "term type": "Character Name",
        "english target translation": "Klein Moretti"
    },
    {
        "entity": "Northern Continent",
        "lemmatized entity": "Northern Continent",
        "chapter cutoff": 10,
        "description": "The Northern Continent is a major geographical and political entity within the world described in the context. It is home to the Loen Kingdom, which in turn contains the county of Awwa and the city of Tingen. The context implies a distinct cultural and historical landscape for this continent, as evidenced by the mention of ancient languages like Feysac and Hermes, and the existence of a colonial conflict with a \"Southern Continent.\" It serves as the primary setting for the protagonist, Klein Moretti, and his family's current circumstances.",
        "term type": "Location",
        "english target translation": "Northern Continent"
    },
    {
        "entity": "Loen Kingdom",
        "lemmatized entity": "Loen Kingdom",
        "chapter cutoff": 10,
        "description": "The Loen Kingdom is a political entity situated on the Northern Continent. It is a significant geographical and administrative division within this region, as indicated by its subdivision into counties and cities, such as Awwa County and the City of Tingen. The kingdom's existence implies a structured governmental system and a defined territory, serving as the primary geopolitical setting for the character Klein Moretti's origins and family background. Its presence establishes the broader world in which Klein's life unfolds, influencing his social standing and opportunities.",
        "term type": "Location",
        "english target translation": "Loen Kingdom"
    },
    {
        "entity": "Awwa County",
        "lemmatized entity": "Awwa County",
        "chapter cutoff": 10,
        "description": "Awwa County is a specific administrative division within the Loen Kingdom, located on the Northern Continent. It serves as a geographical identifier for the city of Tingen, where the character Klein Moretti resides. Its inclusion in the context establishes Klein's precise origin and the socio-economic backdrop of his family, suggesting a region that is not particularly affluent, given the description of their living situation.",
        "term type": "Location",
        "english target translation": "Awwa County"
    },
    {
        "entity": "City of Tingen",
        "lemmatized entity": "City of Tingen",
        "chapter cutoff": 10,
        "description": "The City of Tingen is a specific geographical location within the Awwa County of the Loen Kingdom, situated on the Northern Continent. It serves as the primary setting for the character Klein Moretti's life and family circumstances. The city's environment, as described through Klein's perspective, appears to be modest and not affluent, reflecting the family's \"somewhat wanting\" financial situation. Its existence grounds Klein's personal history and the narrative's initial setting.",
        "term type": "Location",
        "english target translation": "City of Tingen"
    },
    {
        "entity": "Department of History",
        "lemmatized entity": "Department of history",
        "chapter cutoff": 10,
        "description": "The Department of History is an academic division within Khoy University, responsible for the study and teaching of historical subjects. As a recent graduate from this department, the individual possesses specialized knowledge, including proficiency in ancient languages like Feysac and Hermes, which are relevant to historical research and textual analysis. This academic background signifies a formal education in understanding past events, cultures, and languages, contributing to the character's intellectual capabilities and potential for engaging with historical mysteries or artifacts.",
        "term type": "Academic Department",
        "english target translation": "Department of History"
    },
    {
        "entity": "Khoy University",
        "lemmatized entity": "Khoy University",
        "chapter cutoff": 10,
        "description": "Khoy University is an institution of higher learning from which the protagonist, Klein Moretti, recently graduated with a degree in History. Its existence implies a structured educational system within the world. The university's name suggests a specific geographical or cultural origin within the narrative's setting, likely in the Northern Continent given Klein's linguistic studies. Admission to Khoy University was facilitated by a bereavement allowance, indicating a system of financial aid or support for students, possibly linked to familial loss.",
        "term type": "Location",
        "english target translation": "Khoy University"
    },
    {
        "entity": "Imperial Army",
        "lemmatized entity": "Imperial Army",
        "chapter cutoff": 10,
        "description": "The \"Imperial Army\" refers to the military force of a past or present empire, likely a powerful and established one given the context of a \"colonial conflict.\" Its mention in relation to Klein's father, who sacrificed himself during such a conflict, imbues it with a sense of historical weight, duty, and potentially, a legacy of service and loss. The term suggests a structured, organized military organization with a history of engagement in territorial expansion or control.",
        "term type": "Organization",
        "english target translation": "Imperial Army"
    },
    {
        "entity": "Southern Continent",
        "lemmatized entity": "southern continent",
        "chapter cutoff": 10,
        "description": "The \"Southern Continent\" refers to a geographical region distinct from the Northern Continent, where the character Klein Moretti resides. It is presented as a place where colonial conflicts occurred, resulting in the sacrifice of Klein's father. This implies a history of geopolitical tension and military engagement between the Northern and Southern Continents, suggesting a power dynamic and potential historical animosity. Its existence serves to establish the broader world-building and the origins of Klein's family history.",
        "term type": "Location",
        "english target translation": "Southern Continent"
    },
    {
        "entity": "Evernight Goddess",
        "lemmatized entity": "Evernight Goddess",
        "chapter cutoff": 10,
        "description": "The Evernight Goddess is a deity worshipped by Klein's mother. Her devotion suggests a significant religious or spiritual aspect to Klein's family background, even if not explicitly detailed further. The mention of her passing in the same year Klein entered university implies a potential connection or a significant life event occurring concurrently with his academic pursuits. The goddess's name itself, \"Evernight,\" evokes themes of darkness, mystery, or perhaps a nocturnal domain, hinting at the potential nature of her worship or influence.",
        "term type": "Character Name",
        "english target translation": "Evernight Goddess"
    },
    {
        "entity": "Earth",
        "lemmatized entity": "earth",
        "chapter cutoff": 10,
        "description": "In this context, \"Earth\" refers to the physical planet or world that the characters inhabit. It is presented as a tangible reality, the setting for their lives and struggles. The mention of \"Northern Continent's Loen Kingdom\" and \"City of Tingen\" grounds this \"Earth\" in a specific, albeit fictional, geographical and political landscape. The term signifies the material existence and the environment within which the characters' experiences unfold, contrasting with any potential spiritual or metaphysical realms.",
        "term type": "Location",
        "english target translation": "Earth"
    },
    {
        "entity": "Feysac language",
        "lemmatized entity": "Feysac language",
        "chapter cutoff": 10,
        "description": "The Feysac language is presented as an ancient and foundational language, believed to be the origin of all languages spoken on the Northern Continent. Its significance lies in its historical depth and its role as a linguistic root. Klein's knowledge of this language, alongside the Hermes language, highlights his academic background and suggests a world where ancient languages hold considerable importance, potentially for understanding history, rituals, or even unlocking hidden knowledge.",
        "term type": "Concept",
        "english target translation": "Feysac language"
    },
    {
        "entity": "Hermes language",
        "lemmatized entity": "Hermes language",
        "chapter cutoff": 10,
        "description": "The Hermes language is an ancient script that appears in historical texts, particularly those related to sacrificial and praying rituals, and is also found in ancient mausoleums. It is considered by some to be the origin of all languages on the Northern Continent. The context suggests it possesses a profound, almost supernatural quality, as text written in it can transform from alien to familiar and readable, evoking a sense of dread and horror in the reader, implying a connection to powerful or unsettling forces.",
        "term type": "Concept",
        "english target translation": "Hermes language"
    }
]